/* 
  Localizable.strings (English)
  AMD Power Gadget
*/

/* NOTE: Some keys use Spanish text for historical reasons. */
/* These are used as lookup identifiers and work correctly. */
/* A future refactor should standardize all keys to English. */

"Dashboard" = "Dashboard";
"Telemetry" = "Telemetria";
"Fan Control" = "Controllo ventole";
"Profiles" = "Profili";
"Advanced" = "Avanzate";
"Menu Bar" = "Barra dei menù";
"System Info" = "Informazioni sul sistema";
"Desktop Widgets" = "Widget del desktop";

"AMD Power" = "AMD Power";
"Gadget" = "Gadget";

"CPU" = "CPU";
"GPU" = "GPU";
"Freq" = "Freq";
"Average" = "Media";
"Avg: %@" = "Media: %@";
"Collecting data…" = "Raccogliendo informazioni…";

"Low Power Mode (LPM)" = "Modalità a basso consumo (LPM)";
"Allows macOS to auto-manage CPU frequency" = "Consenti a macOS di gestire automaticamente la frequenza della CPU";
"Forces CPU to lowest frequency for minimum power" = "Forza la CPU ad utilizzare la frequenza minima per minimizzare i consumi";
"Core Performance Boost (CPB)" = "Core Performance Boost (CPB)";
"Update Interval" = "Intervallo di aggiornamento";
"Adjust how frequently telemetry data updates. Lower = more responsive, higher = less CPU usage." = "Regola quanto frequentemente aggiornate i dati della telemetria. Meno frequente = più reattivo, Più frequente = meno uso della CPU.";

"Opciones en Menú Bar" = "Opzioni della barra dei menù";
"Choose which items appear in the menu bar. Changes apply immediately." = "Scegli quali elementi mostrare nella barra dei menù. I cambiamenti si applicano immediatamente.";
"Customize the visual appearance of the menu bar items." = "Personalizza l'aspetto degli elementi della barra dei menù.";
"Límite de Temp de Alerta" = "Allerta temperatura limite";
"Color de Alerta de Temp" = "Colore dell'allerta temperatura limite";
"Color de Flechas" = "Colore delle frecce";
"Additional telemetry for the menu bar." = "Telemetria aggiuntiva nella barra dei menù.";
"GPU data is shown inside Temp, Power, Memory and Fan columns when enabled." = "Le informazioni della GPU vengono mostrate nelle colonne Temp, Consumi, Memoria e Ventole quando abilitate.";
"Show GPU VRAM" = "Mostra l'utilizzo della VRAM della GPU";
"G:X.XG in Memory column" = "G:X.XG nella colonna della memoria";
"Show GPU Fan Speed" = "Mostra la velocità della ventola della GPU";
"G:XXXX in Fan column" = "G:XXXX nella colonna della ventola";

"No fans detected." = "Nessuna ventola rilevata.";
"SMC driver not available" = "Il driver SMC non è disponibile";
"Your SMC chip may not be supported." = "Il tuo chip SMC potrebbe non essere supportato.";
"RPM" = "RPM";
"Throttle" = "Throttle";
"↩ Reset to Auto" = "Reimposta a Auto";

"Select a profile to adjust the CPU operating range. Changes take effect immediately." = "Scegli un profilo per regolare l'intervallo di lavoro della CPU. I cambiamenti vengono applicati immediatamente.";

"Directly edit raw P-State registers. Requires kext privilege check disabled via boot-arg or root." = "Modifica direttamente i registri P-State. Necessita il controllo dei privilegi kext disabilitato tramite boot-arg o root.";
"This will write the raw P-State definitions directly to the CPU. Proceed?" = "Stai per applicare delle definizioni P-State direttamente alla CPU. Procedere?";
"Disabled — work in progress" = "Disabilitato - work in progress";
"WIP" = "WIP";

"Enable in OC: Misc → Security → ExposeSensitiveData = 0x08" = "Abilitata su OC: Misc → Security → ExposeSensitiveData = 0x08";
"Motherboard info not available" = "Informazioni sulla scheda madre non disponibili";

"Vista previa de la Barra de Menús:" = "Preview della barra dei menù:";
"Ancho estimado: %dpt" = "Estimated Width: %dpt";
"Restart the app to fully apply width changes." = "Restart the app to fully apply width changes.";
"Small (%dpt)" = "Small (%dpt)";
"Medium (%dpt)" = "Medium (%dpt)";
"Large (%dpt)" = "Large (%dpt)";

"Green" = "Green";
"Blue" = "Blue";
"Orange" = "Orange";
"Red" = "Red";
"Purple" = "Purple";
"Pink" = "Pink";
"Teal" = "Teal";
"Turquoise" = "Turquoise";

"Verde" = "Green";
"Azul" = "Blue";
"Naranja" = "Orange";
"Rojo" = "Red";
"Morado" = "Purple";
"Rosa" = "Pink";
"Turquesa" = "Teal";

"Dynamic Colors (Temp Only)" = "Dynamic Colors (Temp Only)";
"Temp Alert Color" = "Temp Alert Color";
"Temp Alert Limit" = "Temp Alert Limit";
"Network" = "Network";
"Network Arrows Color" = "Network Arrows Color";
"Exit" = "Exit";
"AMD Power Gadget" = "AMD Power Gadget";
"AMD Power Tool" = "AMD Power Tool";
"SMC Fans" = "SMC Fans";

"Fan 1" = "Fan 1";
"Fan 2" = "Fan 2";
"Fan 3" = "Fan 3";
"Fan 4" = "Fan 4";
"Fan 5" = "Fan 5";
"Fan 6" = "Fan 6";
"Fan 7" = "Fan 7";
"Fan 8" = "Fan 8";

/* Alerts */
"To enable motherboard display:" = "To enable motherboard display:";
"Open your OpenCore config file,\n\nGo to Misc -> Security -> ExposeSensitiveData,\n\nSet the value to 0x08 to expose board information." = "Open your OpenCore config file,\n\nGo to Misc -> Security -> ExposeSensitiveData,\n\nSet the value to 0x08 to expose board information.";
"Done" = "Done";
"Invalid Input" = "Invalid Input";
"Please type in numbers in hexadecimal." = "Please type in numbers in hexadecimal.";
"Unable to Set PStateDef" = "Unable to Set PStateDef";
"Action was denied as current user does not have enough privilege,\nor was canceled by current user.\n\nRun AMD Power Gadget as root user or disable privilege check with boot-arg '-amdpnopchk'\n\nOtherwise, click 'Once' in the warning message to allow this change." = "Action was denied as current user does not have enough privilege,\nor was canceled by current user.\n\nRun AMD Power Gadget as root user or disable privilege check with boot-arg '-amdpnopchk'\n\nOtherwise, click 'Once' in the warning message to allow this change.";
"Your changes will not be saved" = "Your changes will not be saved";
"Click apply to save changes before closing this windows." = "Click apply to save changes before closing this windows.";
"Cancel" = "Cancel";
"Close without saving" = "Close without saving";
"Invalid File" = "Invalid File";
"The selected file could not be read or is not a valid pstate file." = "The selected file could not be read or is not a valid pstate file.";
"OK" = "OK";

/* Dynamic format strings */
"Avg: %.2f GHz, Max: %.2f GHz" = "Avg: %.2f GHz, Max: %.2f GHz";
"%.2f °C" = "%.2f °C";
"%.2f Watt" = "%.2f W";

/* Session Peaks */
"Session Peaks" = "Session Peaks";
"Reset Peaks" = "Reset Peaks";

/* GPU Fan Control */
"GPU Fan Control (Zero RPM / Curves)" = "GPU Fan Control (Zero RPM / Curves)";
"macOS Hardware Limitation" = "macOS Hardware Limitation";
"Direct software-based GPU fan speed overrides (such as zero-rpm toggle or drawing fan curves in macOS) are not supported by the macOS kernel/IOKit driver for AMD GPUs. The GPU's onboard firmware (vBIOS) manages the fans." = "Direct software-based GPU fan speed overrides (such as zero-rpm toggle or drawing fan curves in macOS) are not supported by the macOS kernel/IOKit driver for AMD GPUs. The GPU's onboard firmware (vBIOS) manages the fans.";
"Standard Hackintosh Solution:" = "Standard Hackintosh Solution:";
"The only way to modify this behavior (like forcing fans to spin at lower temperatures or disabling Zero RPM) is by exporting the vBIOS, creating a Soft PowerPlay Table (SPPT), and injecting it via OpenCore's config.plist under DeviceProperties." = "The only way to modify this behavior (like forcing fans to spin at lower temperatures or disabling Zero RPM) is by exporting the vBIOS, creating a Soft PowerPlay Table (SPPT), and injecting it via OpenCore's config.plist under DeviceProperties.";
"Open SPPT Guide" = "Open SPPT Guide";
"MorePowerTool" = "MorePowerTool";

/* CPPC & EPP */
"Native CPPC Active Mode (EPP)" = "Native CPPC Active Mode (EPP)";
"Enables autonomous hardware frequency scaling (recommended)" = "Enables autonomous hardware frequency scaling (recommended)";
"Power Management Mode" = "Power Management Mode";
"Energy Preference (EPP)" = "Energy Preference (EPP)";
"Select a hardware autonomous profile. The CPU will scale frequency dynamically." = "Select a hardware autonomous profile. The CPU will scale frequency dynamically.";
"Performance" = "Performance";
"Balanced Perf" = "Balanced Perf";
"Balanced Power" = "Balanced Power";
"Power Save" = "Power Save";
"Active Profile Status" = "Active Profile Status";
"CPU Speed Profiles (Legacy)" = "CPU Speed Profiles (Legacy)";
"Select a manual P-State override profile. Frequencies will be restricted to the selected step." = "Select a manual P-State override profile. Frequencies will be restricted to the selected step.";
"Mode" = "Mode";
"EPP Profile" = "EPP Profile";

/* Desktop Widgets */
"Show CPU Widget" = "Show CPU Widget";
"Show GPU Widget" = "Show GPU Widget";
"Show RAM Widget" = "Show RAM Widget";
"Show Disk Widget" = "Show Disk Widget";
"Show Network Widget" = "Show Network Widget";
"Show Fan Widget" = "Show Fan Widget";
"Disable All Widgets" = "Disable All Widgets";
"Sort by Rank" = "Sort by Rank";
"Edit Widget Layout" = "Edit Widget Layout";
"Unlock widgets to drag them around the screen" = "Unlock widgets to drag them around the screen";
"Widget Options" = "Widget Options";
"Customize the appearance and behavior of your desktop widgets." = "Customize the appearance and behavior of your desktop widgets.";
"Auto-Align Active Widgets" = "Auto-Align Active Widgets";
"Automatically stack active widgets at a corner" = "Automatically stack active widgets at a corner";
"Alignment Corner" = "Alignment Corner";
"Top Right" = "Top Right";
"Top Left" = "Top Left";
"Bottom Right" = "Bottom Right";
"Bottom Left" = "Bottom Left";
"Show Clock Widget" = "Show Clock Widget";
"Clock" = "Clock";
"Stats Table" = "Stats Table";
"Classic Glass" = "Classic Glass";
"Pro Monitor" = "Pro Monitor";
"Core Matrix" = "Core Matrix";

"United" = "United";
"Show United Widget" = "Show United Widget";
"Configure Combined Metrics" = "Configure Combined Metrics";
"Include CPU" = "Include CPU";
"Include GPU" = "Include GPU";
"Include RAM" = "Include RAM";
"Include Disk" = "Include Disk";
"Include Network" = "Include Network";
"Include Fan" = "Include Fan";

"Temas & Apariencia" = "Themes & Appearance";
"Análisis" = "Analysis";

"Select Visual Theme (Instant Application)" = "Select Visual Theme (Instant Application)";
"Custom Theme Creator & Exchange (JSON)" = "Custom Theme Creator & Exchange (JSON)";
"Chart Rendering Style" = "Chart Rendering Style";
"Custom Theme Editor" = "Custom Theme Editor";
"Showing active theme colors. Adjust any color to customize." = "Showing active theme colors. Adjust any color to customize.";
"Edit Active Theme" = "Edit Active Theme";
"Export Theme (JSON)" = "Export Theme (JSON)";
"Import Theme (JSON)" = "Import Theme (JSON)";
"Card Background" = "Card Background";
"Cyan Accent" = "Cyan Accent";
"Orange Accent" = "Orange Accent";
"Green Accent" = "Green Accent";
"Purple Accent" = "Purple Accent";
